[
  {
    "id": 1,
    "title": "Plataforma de Gerenciamento de Tarefas - TaskManager",
    "subtitle": "Sistema de Gestão de Produtividade e Colaboração",
    "technologies": [
      "React",
      "Java",
      "Spring Boot",
      "Spring Security",
      "MongoDB",
      "Docker"
    ],
    "link": "https://github.com/GeneSys-fatec/API-3DSM",
    "status": "Concluído",
    "description": "O TaskManager é uma solução robusta para gestão de produtividade corporativa. O objetivo primordial foi arquitetar um ecossistema digital onde equipes multidisciplinares pudessem colaborar em tempo real, dispondo de atualizações instantâneas de status e métricas detalhadas de desempenho individual, assegurando a fluidez operacional.",
    "contributions": [
      "O desenvolvimento Fullstack foi conduzido através da implementação de uma arquitetura de microsserviços em Java, visando garantir a modularidade, o baixo acoplamento e a escalabilidade vertical do backend.",
      "A camada de segurança foi estruturada utilizando o framework Spring Security integrado ao padrão JWT, assegurando a integridade, a confidencialidade e a autenticidade das transações de dados.",
      "A implementação de componentes visuais em React foi padronizada para garantir a consistência da UX/UI, facilitando a manutenibilidade do código e a extensibilidade futura da aplicação.",
      "A modelagem do banco de dados NoSQL (MongoDB) foi desenhada para suportar alta volumetria, otimizando o tempo de resposta das queries para as métricas de desempenho."
    ],
    "softSkills": [
      {
        "name": "Visão Sistêmica e Arquitetural",
        "description": "A necessidade de integrar frontend, backend e banco de dados exigiu uma compreensão holística do sistema, permitindo a antecipação de gargalos de performance e a tomada de decisões projetuais que priorizaram a robustez da solução final."
      },
      {
        "name": "Resolução de Problemas Complexos",
        "description": "O desafio de implementar autenticação segura em uma arquitetura distribuída demandou uma abordagem analítica para solucionar conflitos de estado e garantir a sincronização de dados em tempo real."
      },
      {
        "name": "Autonomia e Gestão de Tempo",
        "description": "A condução do desenvolvimento de ponta a ponta requereu uma rigorosa organização pessoal e priorização de tarefas críticas, assegurando que as entregas de valor fossem cumpridas dentro do cronograma."
      }
    ],
    "futureLearning": "O projeto TaskManager serviu como um catalisador para o desenvolvimento de competências não apenas técnicas, mas de organização e desenvolvimento em equipe sob pressão de prazos. Foi observado que a resolução de problemas complexos – como a integração de códigos e a reformulação da arquitetura do sistema em Java e Spring Boot – exigiu uma busca ativa e autônoma por conhecimento além do escopo da sala de aula. Para o próximo ciclo, o foco de aprimoramento reside na Comunicação Interpessoal e Inteligência Emocional, visando otimizar a tomada de decisão em equipe e mitigar atritos durante as fases críticas do projeto."
  },
  {
    "id": 2,
    "title": "Sistema de Dashboard Financeiro",
    "subtitle": "Aplicação para controle de finanças de empresas parceiras",
    "technologies": ["React", "TypeScript", "Next.JS", "MySQL", "Chart.js"],
    "link": "https://github.com/ORBIS-2DSM-API/orbis-main",
    "status": "Concluído",
    "description": "Dashboard interativo focado em oferecer visualização clara da saúde financeira. O desafio principal foi transformar dados brutos e complexos em gráficos intuitivos para tomadores de decisão, utilizando processamento otimizado de dados.",
    "contributions": [
      "A arquitetura do Front-end foi desenvolvida focando na otimização do processamento de dados no lado do cliente, reduzindo a latência e a carga no servidor principal.",
      "A integração com a biblioteca Chart.js foi customizada para permitir a renderização dinâmica de gráficos de fluxo de caixa, facilitando a análise visual de tendências financeiras.",
      "A refatoração do código legado de JavaScript para TypeScript foi implementada para aumentar a tipagem estática, garantindo maior segurança na execução e manutenibilidade do código a longo prazo."
    ],
    "softSkills": [
      {
        "name": "Pensamento Crítico e Analítico",
        "description": "A análise dos requisitos de negócio fundamentou a decisão de migrar a renderização para Server-Side (Next.js), o que resultou em uma melhoria significativa no SEO e na performance inicial da aplicação."
      },
      {
        "name": "Proatividade e Autogestão",
        "description": "A postura proativa na busca por refatorações e documentação técnica garantiu que o débito técnico fosse mantido sob controle, permitindo um ciclo de desenvolvimento mais ágil."
      },
      {
        "name": "Comunicação Assertiva",
        "description": "A participação ativa nas revisões de código (Code Reviews) permitiu a identificação precoce de falhas estruturais, onde a proposição de soluções construtivas elevou a qualidade técnica das entregas do time."
      }
    ]
  },
  {
    "id": 3,
    "title": "DemoQuerycy - Dados dos Vereadores",
    "subtitle": "Plataforma de transparência legislativa e análise de dados",
    "technologies": ["JavaScript", "Python", "HTML5", "CSS3", "MySQL", "Flask"],
    "link": "https://github.com/AgileKrakens/DemoQuerycy",
    "status": "Concluído",
    "description": "A plataforma DemoQuerycy foi concebida para democratizar o acesso à informação legislativa. O projeto traduz dados complexos do mandato 2020-2024 de São José dos Campos em visualizações acessíveis, promovendo a transparência pública através da tecnologia.",
    "contributions": [
      "A liderança técnica no desenvolvimento do Front-end garantiu a transposição fidedigna dos protótipos de alta fidelidade para interfaces funcionais, assegurando a responsividade e a acessibilidade da informação em diferentes dispositivos.",
      "A colaboração no Back-end envolveu a implementação e manutenção de algoritmos de Web Scraping em Python (utilizando BeautifulSoup e Selenium), essenciais para a extração automatizada e integridade da base de dados legislativa.",
      "A integração fullstack entre a interface do usuário e as APIs do Back-end foi realizada para permitir o consumo eficiente dos dados processados, gerando visualizações dinâmicas em tempo real.",
      "A implementação de lógicas de filtragem no lado do cliente (Client-Side) foi otimizada para melhorar a experiência do usuário, permitindo a análise granular dos dados sem comprometer a performance da aplicação."
    ],
    "softSkills": [
      {
        "name": "Adaptabilidade Técnica",
        "description": "A necessidade de atuar em um escopo multidisciplinar exigiu flexibilidade para transitar entre o desenvolvimento Front-end e a estruturação de scripts de dados em Python, garantindo a coesão entre a coleta e a exibição da informação."
      },
      {
        "name": "Trabalho em Equipe e Integração",
        "description": "A atuação como ponto focal entre as equipes de Design e Engenharia de Dados assegurou que as interfaces projetadas fossem tecnicamente viáveis e que os dados extraídos fossem apresentados com clareza e precisão."
      },
      {
        "name": "Foco na Experiência do Usuário (UX)",
        "description": "A priorização da usabilidade durante a construção das interfaces permitiu transformar conjuntos de dados brutos e complexos em layouts intuitivos, facilitando a compreensão do cenário político pelo cidadão comum."
      }
    ]
  }
]